{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_104": {"name": "keras_tensor_104:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_33_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_33_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_34_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_34_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "keras_tensor_104", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_33_1/Relu", "op": "_FusedConv2D", "input": ["keras_tensor_104", "StatefulPartitionedCall/sequential_14_1/conv2d_33_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_14_1/conv2d_33_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/max_pooling2d_21_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_33_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_34_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_14_1/max_pooling2d_21_1/MaxPool2d", "StatefulPartitionedCall/sequential_14_1/conv2d_34_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_14_1/conv2d_34_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/max_pooling2d_22_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_34_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_14_1/max_pooling2d_22_1/MaxPool2d", "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_35_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Shape", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/Shape", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose", "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/Relu", "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_14_1/reshape_7_1/Shape", "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack", "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice", "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape/1", "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Sigmoid", "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/conv_transpose/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/conv_transpose/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_33_1/convolution/ReadVariableOp", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_33_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_34_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_34_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_35_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_15_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_transpose_16_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/conv2d_36_1/Reshape", "shape": [1, 1, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_14_1/reshape_7_1/Reshape/shape/2", "shape": [], "dtype": "int32"}]}]}